In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data=pd.read_excel('database.xlsx')

In [4]:
data.head(3)

   sr no seat no    name    middle surname P/A=null  marks grade
0      1  CO3010  Mrinal  Narendra    More        P   89.0     A
1      2  CO3011   Aarav       Raj  Sharma        P   88.0     B
2      3  CO3012   Priya      Neha   Gupta        P   92.0     A

In [5]:
df2=data.copy()

In [6]:
df2.isnull().sum()

sr no       0
seat no     0
name        0
middle      0
surname     0
P/A=null    0
marks       5
grade       0
dtype: int64

In [7]:
for col in data.columns:
    if df2[col].isnull().any():
        df2[col]=df2[col].fillna(value=df2[col].mean())
df2.isnull().sum()

sr no       0
seat no     0
name        0
middle      0
surname     0
P/A=null    0
marks       0
grade       0
dtype: int64